	
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СтартовыйСостав.Футболист КАК Футболист
	                      |ПОМЕСТИТЬ ВтСтартовыйСостав
	                      |ИЗ
	                      |	&СтартовыйСостав КАК СтартовыйСостав
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВтСтартовыйСостав.Футболист КАК Футболист,
	                      |	КОЛИЧЕСТВО(ВтСтартовыйСостав.Футболист) КАК КоличествоИспользований
	                      |ИЗ
	                      |	ВтСтартовыйСостав КАК ВтСтартовыйСостав
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВтСтартовыйСостав.Футболист
	                      |
	                      |ИМЕЮЩИЕ
	                      |	КОЛИЧЕСТВО(ВтСтартовыйСостав.Футболист) > 1"); 
	Запрос.УстановитьПараметр("СтартовыйСостав", СтартовыйСостав.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда                          
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Футболист %1 включен в стартовый состав несколько раз.'"), Выборка.Футболист);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти	

#КонецЕсли
	 