	
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	НавыкиПоПозициям = ИгровыеМеханики.КлючевыеНавыкиПозиций(); 
	Навыки = НавыкиПоПозициям[Позиция];
	
	ВзвешенноеЗначениеНавыков = 0;
	СуммаКоэффициентов = 0;  
	
	Для Каждого КлючИЗначение Из Навыки Цикл   
		СуммаКоэффициентов = СуммаКоэффициентов + КлючИЗначение.Значение;
		ВзвешенноеЗначениеНавыков = ВзвешенноеЗначениеНавыков + ЭтотОбъект[КлючИЗначение.Ключ] * КлючИЗначение.Значение;
	КонецЦикла; 
	
	Рейтинг = ВзвешенноеЗначениеНавыков / СуммаКоэффициентов;
	
КонецПроцедуры

#КонецОбласти	

#КонецЕсли
	 