	 
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РассчитатьТрансфернуюСтоимостьФутболистов(Команда)
	
	РассчитатьТрансфернуюСтоимостьФутболистовНаСервере();  
	
КонецПроцедуры

#КонецОбласти	 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РассчитатьТрансфернуюСтоимостьФутболистовНаСервере()
	
    ЗначениеОбъекта = РеквизитФормыВЗначение("Объект"); 
	ЗначениеОбъекта.РассчитатьТрансфернуюСтоимостьФутболистов();
	РеквизитФормыВЗначение("Объект", ЗначениеОбъекта);
	
КонецПроцедуры

#КонецОбласти	 

